Revit 2027 API
BuiltInFailures.KeynoteTagFailures.KeynoteOnLinkWithDifferentKeynoteFile Property
 The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId KeynoteOnLinkWithDifferentKeynoteFile { get; }
Public Shared ReadOnly Property KeynoteOnLinkWithDifferentKeynoteFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ KeynoteOnLinkWithDifferentKeynoteFile {
	FailureDefinitionId^ get ();
}
static member KeynoteOnLinkWithDifferentKeynoteFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeynoteTagFailures Class
Autodesk.Revit.DB Namespace